src/cf/maERP_ib/src/DataProcessors/ЗагрузкаИзExcel/ЗагрузкаИзExcel.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаИзExcel</name>
</mdclass:DataProcessor>

src/cf/maERP_ib/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/maERP_ib/src/DataProcessors/ЗагрузкаИзExcel/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите Excel-файл";
	Диалог.ПолноеИмяФайла = ПутьКФайлу;
	Диалог.Фильтр = "Таблицы (*.xls,*.xlsx)|*.xls;*.xlsx;|Microsoft Excel 97/2000/XP/2003 (*.xls)|*.xls|Microsoft Excel 2007/2010 (*.xlsx)|*.xlsx";	
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
		ИмяФайла = СтрЗаменить(Диалог.ПолноеИмяФайла,Диалог.Каталог,"");
		
		ДД = Новый ДвоичныеДанные(ПутьКФайлу);
		АдресВХ = ПоместитьВоВременноеХранилище(ДД);

		ЗаполнитьТаблицуИзФайлаНаСервере(АдресВХ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуИзФайлаНаСервере(АдресВХ)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	
	ДД = ПолучитьИзВременногоХранилища(АдресВХ);
	ДД.Записать(ИмяВременногоФайла);

	СпособЧтения = СпособЧтенияЗначенийТабличногоДокумента.Значение;

	ТабДок.Очистить();
	Попытка
		ТабДок.Прочитать(ИмяВременногоФайла, СпособЧтения);
	Исключение
	КонецПопытки;	
	

	//ТабДок.Прочитать(ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Элементы.Область1.СписокВыбора.Очистить();
	Для Каждого Обл из ТабДок.Области Цикл 
		Элементы.Область1.СписокВыбора.Добавить(Обл.Имя);
	КонецЦикла;
	Если ЗначениеЗаполнено(Область1) Тогда 
		Если Элементы.Область1.СписокВыбора.НайтиПоЗначению(Область1) = Неопределено Тогда 
			Область1 = "";
			Если Не Элементы.Область1.СписокВыбора.Количество() = 0 Тогда 
				Область1 = Элементы.Область1.СписокВыбора.Получить(0).Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьТоварыНаСервере()
	Для Каждого Стр из ТЗТовары Цикл
		Код = Стр.ID;
		//Пока СтрДлина(Код) < 11 Цикл 
		//	Код = "0"+Код;
		//КонецЦикла;
		Спр = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Код);
		Если Спр = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Об = Справочники.Номенклатура.СоздатьЭлемент();
		Иначе
			Продолжить;
			Об = спр.ПолучитьОбъект();
		КонецЕсли;
		//Об.Код = Код;
		Об.Артикул = Стр.BarCode;
		Об.Наименование = Стр.Product;
		Об.НаименованиеПолное = Стр.Product;
		Об.Родитель = Категория;
		Об.Единица = Константы.ЕдиницаПоУмолчанию.Получить();
		Об.МинимальноеКоличествоХранения = Стр.QuantityMin;
		Об.СтавкаНДС = Константы.СтавкаНДСПоУмолчанию.Получить();
		Об.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
		Марка = Справочники.Бренды.НайтиПоНаименованию(Стр.Marque);
		Если Марка = Справочники.Бренды.ПустаяСсылка() Тогда 
			ОбМарка = Справочники.Бренды.СоздатьЭлемент();
			ОбМарка.Наименование = Стр.Marque;
			ОбМарка.Записать();
			Марка = ОбМарка.Ссылка;
		КонецЕсли;
		Об.Бренд = Марка;
		Об.Записать();
		Штрихкод = Стр.ID;
		Если ЗначениеЗаполнено(Штрихкод) Тогда
			НЗ = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
			НЗ.Штрихкод = Штрихкод;
			НЗ.Номенклатура = Об.Ссылка;
			НЗ.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТовары(Команда)
	СоздатьТоварыНаСервере();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДокументНаСервере()
	Мас = Новый Массив;
	Для Каждого Стр из ТЗТовары Цикл
		Структура = Новый Структура("Номенклатура,Количество,КоличествоУпаковок,Цена,ЦенаРозничная,ЦенаМинимальная");
		Код = Стр.ID;
		КодПоставщика = Стр.CodeFournisseur;
		//Пока СтрДлина(Код) < 11 Цикл 
		//	Код = "0"+Код;
		//КонецЦикла;
		Спр = Справочники.Номенклатура.ПустаяСсылка();
		Если ЗначениеЗаполнено(КодПоставщика) Тогда 
			Спр = Справочники.Номенклатура.НайтиПоРеквизиту("КодПоставщика",КодПоставщика);
		КонецЕсли;
		Если Спр = Справочники.Номенклатура.ПустаяСсылка() и ЗначениеЗаполнено(Код) Тогда 
			Спр = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Код);
		КонецЕсли;
		Если Спр = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Если СоздаватьТовары Тогда
				Спр = СоздатьТовар(Стр)
			Иначе
				//Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если Стр.Quantity <= 0 тогда 
			Продолжить;
		КонецЕсли;
		Структура.Номенклатура = Спр.Ссылка;
		Структура.Количество = Стр.Quantity;
		Структура.КоличествоУпаковок = Стр.Quantity;
		Структура.Цена = Стр.Price;
		Структура.ЦенаРозничная = Стр.SalePrice;
		Структура.ЦенаМинимальная = Стр.PriceMin;
		Мас.Добавить(Структура);
	КонецЦикла;
	Возврат Мас;
КонецФункции

Функция СоздатьТовар(Стр)
	Об = Справочники.Номенклатура.СоздатьЭлемент();
	Об.Артикул = Стр.BarCode;
	Об.Наименование = Стр.Product;
	Об.КодПоставщика = Стр.CodeFournisseur;
	Об.НаименованиеПолное = Стр.Product;
	Об.Родитель = ?(ЗначениеЗаполнено(Стр.Categorie),Справочники.Номенклатура.НайтиПоНаименованию(Стр.Categorie,Истина,Справочники.Номенклатура.ПустаяСсылка()), Категория);
	Об.Единица = Константы.ЕдиницаПоУмолчанию.Получить();
	Об.МинимальноеКоличествоХранения = Стр.QuantityMin;
	Об.СтавкаНДС = Константы.СтавкаНДСПоУмолчанию.Получить();
	Об.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
	Марка = Справочники.Бренды.ПустаяСсылка();
	Если ЗначениеЗаполнено(Стр.Marque) Тогда 
		Марка = Справочники.Бренды.НайтиПоНаименованию(Стр.Marque);
		Если Марка = Справочники.Бренды.ПустаяСсылка() Тогда 
			ОбМарка = Справочники.Бренды.СоздатьЭлемент();
			ОбМарка.Наименование = Стр.Marque;
			ОбМарка.Записать();
			Марка = ОбМарка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Об.Бренд = Марка;
	Об.Записать();
	Штрихкод = Стр.BarCode;
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		НЗ = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		НЗ.Штрихкод = Штрихкод;
		НЗ.Номенклатура = Об.Ссылка;
		НЗ.Записать(Истина);
	КонецЕсли;
	Возврат Об.Ссылка;
КонецФункции

&НаСервере
Функция СоздатьГруппуНаСервере(Наименование)
	Если Не ЗначениеЗаполнено(Наименование) Тогда 
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ИСТИНА
	|	И Номенклатура.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Об = Справочники.Номенклатура.СоздатьГруппу();
	Об.Наименование = Наименование;
	Об.Записать();
	Возврат Об.Ссылка;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	//СоздатьТоварыНаСервере();
	Мас = ЗаполнитьДокументНаСервере();
	Закрыть(Мас);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	КоличествоЛистовДокумента = ТабДок.Области.Количество();
	Если КоличествоЛистовДокумента <= 1 Тогда
        ИтогоСтрок = ТабДок.ВысотаТаблицы;
    Иначе
        ИтогоСтрок = ТабДок.Области.Найти(Область1).Низ;
	КонецЕсли;
	ИтогоСтрок = Мин(ИтогоСтрок,СтрокаПоследняя);
	ТЗТовары.Очистить();
	Для НомерСтроки = Строка1 По ИтогоСтрок Цикл
		ID = "";
		Наименование = "";
		КодПоставщика = "";
		Если Не КолонкаТовар = 0 Тогда 
			Наименование = СокрЛП(ТабДок.Область(НомерСтроки,КолонкаТовар,НомерСтроки,КолонкаТовар).Текст);
		КонецЕсли;
		Если Не КолонкаКодПоставщика = 0 Тогда 
			КодПоставщика = СокрЛП(ТабДок.Область(НомерСтроки,КолонкаКодПоставщика,НомерСтроки,КолонкаКодПоставщика).Текст);
		КонецЕсли;
		Если Не КолонкаИД = 0 Тогда 
			ID = СокрЛП(ТабДок.Область(НомерСтроки,КолонкаИД,НомерСтроки,КолонкаИД).Текст);									
			ID = СтрЗаменить(ID," ","");
			ID = СтрЗаменить(ID, Символы.НПП, "");
		КонецЕсли;
		Если НЕ ПустаяСтрока(Наименование) или Не ПустаяСтрока(ID) Или Не ПустаяСтрока(КодПоставщика) Тогда
			СтрокаТЧ = ТЗТовары.Добавить();
			Если КолонкаКатегория = 0 Тогда
				СтрокаТЧ.Categorie = Категория;
			Иначе
				СтрокаТЧ.Categorie	= ?(ПустаяСтрока(СокрЛП(ТабДок.Область(НомерСтроки,КолонкаКатегория,НомерСтроки,КолонкаКатегория).Текст)),Категория,СокрЛП(ТабДок.Область(НомерСтроки,КолонкаКатегория,НомерСтроки,КолонкаКатегория).Текст));
			КонецЕсли;
			СтрокаТЧ.ID	= ID;									
			СтрокаТЧ.Product = Наименование;
			СтрокаТЧ.CodeFournisseur = КодПоставщика;
			//BarCode = СокрЛП(ТабДок.Область(НомерСтроки,КолонкаИД,НомерСтроки,КолонкаИД).Текст);
			//BarCode = СтрЗаменить(BarCode," ","");
			//BarCode = СтрЗаменить(BarCode, Символы.НПП, "");
			СтрокаТЧ.BarCode = ID;
			Если Не КолонкаМарка = 0 Тогда 
				СтрокаТЧ.Marque = СокрЛП(ТабДок.Область(НомерСтроки,КолонкаМарка,НомерСтроки,КолонкаМарка).Текст);
			КонецЕсли;
			Если Не КолонкаКол = 0 Тогда 
				Quantity = СокрЛП(ТабДок.Область(НомерСтроки,КолонкаКол,НомерСтроки,КолонкаКол).Текст);
				//Quantity = Лев(Quantity,СтрНайти(Quantity,":")-1);
				СтрокаТЧ.Quantity = Quantity;
			КонецЕсли;
			//Если СтрокаТЧ.Quantity = 0 Тогда 
			//	СтрокаТЧ.Quantity = 1;
			//КонецЕсли;
			//СтрокаТЧ.QuantityMin	= СокрЛП(ТабДок.Область(НомерСтроки,6,НомерСтроки,6).Текст);
			Если Не КолонкаЦена = 0 Тогда
				Попытка
					СтрокаТЧ.Price = Число(СокрЛП(ТабДок.Область(НомерСтроки,КолонкаЦена,НомерСтроки,КолонкаЦена).Текст));
				Исключение
					СтрокаТЧ.Price = 0;
				КонецПопытки;
			КонецЕсли;
			Если Не КолонкаЦенаПрод = 0 Тогда 
				Попытка
					СтрокаТЧ.SalePrice = Число(СокрЛП(ТабДок.Область(НомерСтроки,КолонкаЦенаПрод,НомерСтроки,КолонкаЦенаПрод).Текст));
				Исключение
					СтрокаТЧ.SalePrice = 0;
				КонецПопытки;
			КонецЕсли;
			Если Не КолонкаЦенаМин = 0 Тогда 
				Попытка
					СтрокаТЧ.PriceMin = Число(СокрЛП(ТабДок.Область(НомерСтроки,КолонкаЦенаМин,НомерСтроки,КолонкаЦенаМин).Текст));
				Исключение
					СтрокаТЧ.PriceMin = 0;
				КонецПопытки;
			КонецЕсли;
		//Иначе
		//	Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	Если Не ЗначениеЗаполнено(КолонкаИД) и не ЗначениеЗаполнено(КолонкаКодПоставщика) Тогда
		ТекстПредупреждения = НСтр("fr = 'Il faut spécifier la colonne ID ou Code fournisseur.'; ru = 'Необходимо указать колонку ID или Код поставщика'; en = ""You must specify the Supplier's ID or Code column.""; es = 'Debe especificar la columna ID o el código del proveedor'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	Если ПроверитьЗаполнение() Тогда 
		ЗаполнитьТаблицуНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.Свойство("СоздаватьТовары") Тогда 
		Элементы.СоздаватьТовары.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
